{
  "0.1.0" : {
    "changes":["Initial version"]
  },
  "0.1.1" : {
    "changes": [
      "Increased default hit chance from 50% to 90%.",
      "Increased latent power base gain formula from 5 * (level - 1) ^ 2 to 10 * (level - 1) ^ 2.",
      "Changed base hp formula to 50 + (25 * level).",
      "Changed base damage formula to 10 * level.",
      "Accuracy now increases chance of getting a more damaging type of hit and Evasion reduces it.",
      "Player can choose bonus traits as a reincarnation bonus instead of automatically getting all previous traits.",
      "Added a summary section above the action log to easily keep track of player and enemy HP.",
      "Encounter generation logic chooses fights against approximately equal level enemies more often."
    ]
  },
  "0.1.2" : {
    "changes": [
      "The player starts with bonus points instead of earning them on the first reincarnation.",
      "Fixed the bonus point calculation and starting traits on the reincarnation page.",
      "Added a new demon: Tormented Dead which inflicts the pain it suffers back on their enemies."
    ]
  },
  "0.2.0" : {
    "changes": [
      "Reimplemented many traits.",
      "Added tactics, which allows demons to emphasize certain attributes and customize their fighting style.",
      "Reduced timer duration for almost all actions",
      "Combat actions which occur on the same round now print at the same time",
      "Added several additional tooltips.",
      "Traits are now leveled from 1 to 10 instead of 1 to 100, with the level increasing every 10 levels."
    ]
  },
  "0.2.1" : {
    "changes": [
      "Fixed a typo, from 'You weak spiritual energy[...]' to 'Your weak spiritual energy[...]'",
      "Changed how attack damage is calculated which was increasing damage based on Power too much",
      "The enemy is cleared when exploring after combat, instead of when the combat ends.",
      "Fixed a bug with starting traits not clearing properly when changed."
    ],
    "compatiblePreviousVersions": ["0.2.0"]
  },
  "0.3.0" : {
    "changes": [
      "Set level cap temporarily to 25.",
      "Don't show the latent power gain on initial demon selection reincarnation",
      "Added a fatigue mechanic which causes damage in long combats, for when two high defense opponents encounter each other.",
      "Enemies gain higher base attributes and lower latent power",
      "Added an automatic reincarnation mechanic, which will automatically restart",
      "Player receives a small health boost, to give them a small edge against level 1 and 2 enemies.",
      "When gaining a level from a kill, the player heals to full",
      "Damage multipliers from power is capped at x100 and from resilience is capped at x0.01",
      "Increased probabilities of greater and lesser level encounters.",
      "Latent power is now capped based on the highest level enemy defeated",
      "Base chance to escape/intimidate is now equal to 25% per level different between the player and the other demon.",
      "The player bonus to chances to intimidate lesser demons is now equal to the player's deceit, minus the other demon's cunning, times 5 (minimum 0); this is in addition to the modifier based on the level difference",
      "The player bonus to chances to escape from greater demons is now equal to the player's cunning, minus the other demon's deceit, times 5 (minimum 0); this is in addition to the level based modifier.",
      "When the player encounters a demon that is significantly weaker than the strongest demon the player has defeated, the enemy demon is instantly killed as they are simply willed out of existence.",
      "When the player is killed by a demon whose level is higher than that of the strongest demon the player has killed, the player will only encounter that demon at that level until the player defeats them, allowing the player to tailor their abilities to defeat that specific enemy.",
      "Player attributes now default to 1 instead of 0",
      "The bonus point cost to increase base attributes now goes up at the total points spent on attributes gets higher.",
      "Critical/Glancing Hits are now +/-20% damage instead of 50%.",
      "The Terrified status now inflicts Precision and Power penalties instead of stunning, which was much stronger than the other options",
      "The Shared Pain trait now reflects 20% damage per level instead of 5%.",
      "The player cannot encounter Greater demons when they're level is below 5."
    ]
  },
  "0.3.1" : {
    "changes": [
      "The exploration, combat, fleeing and intimidation timers are all now 2 seconds"
    ],
    "compatiblePreviousVersions": ["0.3.0"]
  }
}